<img src = "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTf9jjHK5jBt7-feZYrBTfxjH4nxQ4J3z3VqYOEeCOBwpe514iDEg" height=50>

# Exam for Numpy and Pandas

In [2]:
import numpy as np
# create 5 X 5 numpy array from five lists
A =
#create a 5 X 5 numpy array from five lists
B = 
# get the operation results of the arrays
print(A+B)
print(A*B)
print(A/B)


# Random numbers

#generate a 100X5 numpy array from numpy
C= 
#create a pandas dataframe using the above numpy with column names ['c1','c2','c3','c4','c5']
import pandas as pd
df =
#print the first three rows of the dataframe
#print the last 7 rows of the dataframe
#get the summary statistics using the describe function
#print out the shape of the dataframe

print(df.info)
print(df.isnull().sum())

SyntaxError: invalid syntax (<ipython-input-2-da0a5f2bfa4b>, line 3)

In [3]:
#practical use of dataframes
#import os
#os.listdir()
import pandas as pd
data =pd.read_excel('Test.xlsx')

data =data.fillna(0)
data.head()

,Date,Supplier,Invoice No,Expense Description,Payment Bank Account,Amount,VAT,Total
0,2018-02-01 00:00:00,Zaesco Spa,0.0,entertainment,Cash,5100.00,0.00,5100
1,2018-02-01 00:00:00,Café Columbiana,0.0,meals,Cash,300.00,0.00,300
2,2018-03-01 00:00:00,Boostop Limited,0.0,office supplies,Cash,1200.00,0.00,1200
3,2018-03-01 00:00:00,Nairobi Java House,0.0,meals,Cash,2290.00,0.00,2290
4,2018-04-01 00:00:00,Nairobi Java House,0.0,meals,Cash,1348.48,211.52,1560

In [ ]:
#select the "Totals" column
T = 
print(T[:20])
#get the sum of the totals column 
X =
print(X)
#get the sum of the Vat column
V =
print(V)

#create another dataframe with the date,Amount and vat columns alone
H =
print(H.head())

#select the first three rows alone
R =
print(R)